export const BackEndSurveyTitle = [
  "문제 해결 능력(1/5)",
  "기술 지식(2/5)",
  "학습 및 개선 의지(3/5)",
  "디버깅 및 테스트(4/5)",
  "협업 및 버전 관리(5/5)",
];

export const BackEndSurveyData = [
  [
    {
      content:
        "복잡한 문제에 직면했을 때 문제를 더 작고 관리 가능한 작업으로 나눌 가능성은 얼마나 됩니까?",
      id: 1,
    },
    {
      content:
        "코드를 작성하기 전에 의사 코드나 다이어그램을 사용하여 코드를 계획하는 빈도는?",
      id: 2,
    },
    { content: "어려운 코딩 문제를 해결하는 것을 즐기십니까?", id: 3 },
    {
      content: "코딩 문제에 봉착했을 때 얼마나 자주 도움을 구합니까?",
      id: 4,
    },
    {
      content: "성능 병목 현상을 찾고 수정하는 것이 얼마나 편합니까?",
      id: 5,
    },
  ],
  [
    {
      content: "당신의 기본 백엔드 언어 숙련도를 어떻게 평가하시겠습니까?",
      id: 6,
    },
    {
      content:
        "SQL 또는 기타 데이터베이스 쿼리 언어를 사용하는 것이 얼마나 편합니까?",
      id: 7,
    },
    { content: "RESTful API 설계에 얼마나 익숙하십니까?", id: 8 },
    {
      content:
        "백엔드 개발을 단순화하기 위해 프레임워크나 라이브러리를 얼마나 자주 사용합니까?",
      id: 9,
    },
    {
      content: "서버리스 아키텍처를 사용하는 것이 얼마나 편합니까?",
      id: 10,
    },
  ],
  [
    {
      content:
        "백엔드 개발과 관련된 새로운 언어, 도구 또는 기술을 얼마나 자주 배우나요?",
      id: 11,
    },
    {
      content:
        "최신 백엔드 개발 동향을 파악하기 위해 정기적으로 블로그, 기사 또는 책을 읽습니까?",
      id: 12,
    },
    {
      content:
        "새로운 정보나 기술을 기반으로 기존 코딩 방식을 변경하는 데 얼마나 개방적입니까?",
      id: 13,
    },
    {
      content: "코딩 기술에 항상 개선의 여지가 있다고 생각하십니까?",
      id: 14,
    },
    {
      content: "기술 향상을 위해 얼마나 자주 코딩 연습이나 도전에 참여합니까?",
      id: 15,
    },
  ],
  [
    { content: "코드에 대한 단위 테스트를 얼마나 자주 작성합니까?", id: 16 },
    {
      content: "복잡한 문제를 디버깅하는 데 얼마나 자신이 있습니까?",
      id: 17,
    },
    {
      content: "문제의 근본 원인을 디버깅하고 찾는 과정이 즐겁습니까?",
      id: 18,
    },
    { content: "개발 중에 디버거 도구를 얼마나 자주 사용합니까?", id: 19 },
    {
      content:
        "백엔드 컨텍스트에서 로깅 및 모니터링 도구를 사용하는 데 얼마나 익숙합니까?",
      id: 20,
    },
  ],
  [
    {
      content: "Git과 같은 버전 제어 시스템을 사용하는 것이 얼마나 편합니까?",
      id: 21,
    },
    {
      content:
        "GitHub 또는 GitLab과 같은 플랫폼을 사용하여 팀 프로젝트에 얼마나 자주 기여합니까?",
      id: 22,
    },
    {
      content:
        "Agile, Scrum 또는 Kanban과 같은 협업 도구 및 방법론에 얼마나 익숙하십니까?",
      id: 23,
    },
    {
      content: "버전 제어에서 병합 충돌을 해결하는 것이 얼마나 편합니까?",
      id: 24,
    },
    { content: "코드 리뷰에 얼마나 자주 참여합니까?", id: 25 },
  ],
];
