export const FrontEndSurveyTitle = [
  "사용자 인터페이스 디자인(1/5)",
  "자바스크립트 및 프레임워크 숙련도(2/5)",
  "성능 최적화(3/5)",
  "디버깅 및 테스트(4/5)",
  "협업 및 버전 관리(5/5)",
];

export const FrontEndSurveyData = [
  [
    {
      content:
        "UI/UX 디자인을 기능적인 웹 페이지로 변환하는 것이 얼마나 편합니까?",
      id: 1,
    },
    {
      content:
        "프론트 엔드 프로젝트를 구축할 때 접근성 지침을 얼마나 자주 고려합니까?",
      id: 2,
    },
    {
      content:
        "다양한 장치와 화면 크기에서 작동하는 반응형 디자인을 만드는 능력에 얼마나 자신이 있습니까?",
      id: 3,
    },
    {
      content:
        "디자인 시스템 또는 UI 라이브러리/프레임워크(예: Material-UI, Ant Design, Bootstrap)에 얼마나 익숙하십니까?",
      id: 4,
    },
    {
      content:
        "디자인 프로세스에서 프로토타이핑 도구(예: Figma, Sketch, Adobe XD)를 얼마나 자주 사용하십니까?",
      id: 5,
    },
  ],
  [
    { content: "당신의 JavaScript 숙련도를 어떻게 평가하시겠습니까?", id: 6 },
    {
      content:
        "최신 JavaScript 기능(ES6 이상)을 사용하는 것이 얼마나 편합니까?",
      id: 7,
    },
    {
      content:
        "JavaScript 프레임워크/라이브러리(예: React, Vue, Angular)에 얼마나 익숙하십니까?",
      id: 8,
    },
    {
      content:
        "프로젝트에서 상태 관리 라이브러리/도구(예: Redux, Vuex, Context API)를 얼마나 자주 사용합니까?",
      id: 9,
    },
    {
      content:
        "자바스크립트에서 비동기 작업(약속, 비동기/대기, 콜백)을 처리하는 것이 얼마나 편합니까?",
      id: 10,
    },
  ],
  [
    {
      content:
        "프론트엔드 애플리케이션을 개발할 때 성능 최적화를 얼마나 자주 고려하십니까?",
      id: 11,
    },
    {
      content:
        "성능 감사를 위해 Lighthouse와 같은 도구를 사용하는 데 얼마나 익숙하십니까?",
      id: 12,
    },
    {
      content:
        "게으른 로딩, 코드 분할, 성능 최적화를 위한 캐싱과 같은 기술을 구현하는 것이 얼마나 편합니까?",
      id: 13,
    },
    {
      content: "귀하의 코드가 SEO에 미치는 영향을 얼마나 자주 고려하십니까?",
      id: 14,
    },
    { content: "서비스 워커 사용에 얼마나 익숙하십니까?", id: 15 },
  ],
  [
    {
      content:
        "프론트엔드 애플리케이션에 대한 테스트를 얼마나 자주 작성합니까?",
      id: 16,
    },
    {
      content:
        "테스트 라이브러리/프레임워크(Jest, Mocha, Jasmine 등)에 얼마나 익숙하십니까?",
      id: 17,
    },
    {
      content:
        "디버깅을 위해 브라우저 개발자 도구를 사용하는 것이 얼마나 편합니까?",
      id: 18,
    },
    { content: "크로스 브라우저 테스트를 얼마나 자주 수행합니까?", id: 19 },
    {
      content:
        "일반적인 프런트엔드 문제(예: 레이아웃 문제, 성능 문제 등)를 해결하는 데 얼마나 편합니까?",
      id: 20,
    },
  ],
  [
    {
      content: "Git과 같은 버전 제어 시스템을 사용하는 것이 얼마나 편합니까?",
      id: 21,
    },
    {
      content:
        "GitHub 또는 GitLab과 같은 플랫폼을 사용하여 팀 프로젝트에 얼마나 자주 기여합니까?",
      id: 22,
    },
    {
      content:
        "Agile, Scrum 또는 Kanban과 같은 협업 도구 및 방법론에 얼마나 익숙하십니까?",
      id: 23,
    },
    {
      content: "버전 제어에서 병합 충돌을 해결하는 것이 얼마나 편합니까?",
      id: 24,
    },
    { content: "코드 리뷰에 얼마나 자주 참여합니까?", id: 25 },
  ],
];
